Revit 2026 API

# SpecTypeIdBoolean Class

---

This class contains constants identifying Boolean specs.

SystemObject Autodesk.Revit.DBSpecTypeIdBoolean

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class Boolean
```
```vb
Public NotInheritable Class Boolean
```
```cpp
public ref class Boolean abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type Boolean = class end
```

The SpecTypeIdBoolean type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | YesNo | Yes/No, in discipline Common. |

#### Reference

Autodesk.Revit.DB Namespace